MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0G3507/mcu.h
/******************************************************************************
* Ignore unused variables                                                     *
******************************************************************************/

#if   defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/******************************************************************************
* Processor and Core Peripheral Section                                       *
******************************************************************************/

#define __CM0PLUS_REV           0x0001U    /* Core revision r0p1 */
#define __MPU_PRESENT           0x0001U    /* MPU present */
#define __VTOR_PRESENT          0x0001U    /* VTOR present */
#define __NVIC_PRIO_BITS        0x0002U    /* Number of bits used for Priority Levels */
#define __Vendor_SysTickConfig  0x0000U    /* Set to 1 if different SysTick Config is used */

#include "core_cm0plus.h"                  /* Processor and core peripherals */
// Note: Added for MikroE implementation.
#define __MSPM0G3507__

/******************************************************************************
* Peripheral headers                                                          *
******************************************************************************/
/** @addtogroup MSPM0G350X_Peripherals MSPM0G350X Peripherals
  MSPM0G350X Peripheral registers structures
  @{
*/

#include <ti/devices/msp/peripherals/hw_adc12.h>
#include <ti/devices/msp/peripherals/hw_aes.h>
#include <ti/devices/msp/peripherals/hw_comp.h>
#include <ti/devices/msp/peripherals/hw_crc.h>
#include <ti/devices/msp/peripherals/hw_dac12.h>
#include <ti/devices/msp/peripherals/hw_dma.h>
#include <ti/devices/msp/peripherals/hw_flashctl.h>
#include <ti/devices/msp/peripherals/hw_gpio.h>
#include <ti/devices/msp/peripherals/hw_gptimer.h>
#include <ti/devices/msp/peripherals/hw_i2c.h>
#include <ti/devices/msp/peripherals/hw_iomux.h>
#include <ti/devices/msp/peripherals/hw_mathacl.h>
#include <ti/devices/msp/peripherals/hw_mcan.h>
#include <ti/devices/msp/peripherals/hw_oa.h>
#include <ti/devices/msp/peripherals/hw_rtc.h>
#include <ti/devices/msp/peripherals/hw_spi.h>
#include <ti/devices/msp/peripherals/hw_trng.h>
#include <ti/devices/msp/peripherals/hw_uart.h>
#include <ti/devices/msp/peripherals/hw_vref.h>
#include <ti/devices/msp/peripherals/hw_wuc.h>
#include <ti/devices/msp/peripherals/hw_wwdt.h>
#include <ti/devices/msp/peripherals/m0p/hw_factoryregion.h>
#include <ti/devices/msp/peripherals/m0p/hw_cpuss.h>
#include <ti/devices/msp/peripherals/m0p/hw_debugss.h>
#include <ti/devices/msp/peripherals/m0p/hw_sysctl.h>

#define __MSPM0_HAS_ADC12__
#define __MSPM0_HAS_AES__
#define __MSPM0_HAS_COMP__
#define __MSPM0_HAS_CRC__
#define __MSPM0_HAS_DAC12__
#define __MSPM0_HAS_GPAMP__
#define __MSPM0_HAS_GPIO__
#define __MSPM0_HAS_TIMER_A__
#define __MSPM0_HAS_TIMER_G__
#define __MSPM0_HAS_I2C__
#define __MSPM0_HAS_MATHACL__
#define __MSPM0_HAS_MCAN__
#define __MSPM0_HAS_OA__
#define __MSPM0_HAS_RTC__
#define __MSPM0_HAS_SPI__
#define __MSPM0_HAS_TRNG__
#define __MSPM0_HAS_UART_EXTD__
#define __MSPM0_HAS_UART_MAIN__
#define __MSPM0_HAS_VREF__
#define __MSPM0_HAS_WWDT__

#define __MSPM0_HAS_ECC__
#define __MSPM0_HAS_LEGACY_ADC_REFERENCE__ 

/*! @brief Workaround added for bug in sineCosine operation in MATHACL */
#define _IQMATH_MATHACL_SINCOS_BUG_WORKAROUND_

/*@}*/ /* end of group MSPM0G350X_Peripherals */

/******************************************************************************
* Device and peripheral memory map                                            *
******************************************************************************/
/** @addtogroup MSPM0G350X_MemoryMap MSPM0G350X Memory Mapping
  @{
*/

#define I2C0_BASE                      (0x400F0000U)     /*!< Base address of module I2C0 */
#define SYSCTL_BASE                    (0x400AF000U)     /*!< Base address of module SYSCTL */
#define WWDT1_BASE                     (0x40082000U)     /*!< Base address of module WWDT1 */
#define CPUSS_BASE                     (0x40400000U)     /*!< Base address of module CPUSS */
#define CANFD0_BASE                    (0x40508000U)     /*!< Base address of module CANFD0 */
#define CANFD0_SRAM_BASE               (0x40508000U)     /*!< Base address of memory CANFD0_SRAM */
#define IOMUX_BASE                     (0x40428000U)     /*!< Base address of module IOMUX */
#define GPIOB_BASE                     (0x400A2000U)     /*!< Base address of module GPIOB */
#define CRC_BASE                       (0x40440000U)     /*!< Base address of module CRC */
#define WWDT0_BASE                     (0x40080000U)     /*!< Base address of module WWDT0 */
#define SPI1_BASE                      (0x4046A000U)     /*!< Base address of module SPI1 */
#define DAC0_BASE                      (0x40018000U)     /*!< Base address of module DAC0 */
#define I2C1_BASE                      (0x400F2000U)     /*!< Base address of module I2C1 */
#define GPIOA_BASE                     (0x400A0000U)     /*!< Base address of module GPIOA */
#define FLASHCTL_BASE                  (0x400CD000U)     /*!< Base address of module FLASHCTL */
#define TRNG_BASE                      (0x40444000U)     /*!< Base address of module TRNG */
#define RTC_BASE                       (0x40094000U)     /*!< Base address of module RTC */
#define SPI0_BASE                      (0x40468000U)     /*!< Base address of module SPI0 */
#define AES_BASE                       (0x40442000U)     /*!< Base address of module AES */
#define DMA_BASE                       (0x4042A000U)     /*!< Base address of module DMA */
#define OPA0_BASE                      (0x40020000U)     /*!< Base address of module OPA0 */
#define OPA1_BASE                      (0x40022000U)     /*!< Base address of module OPA1 */
#define TIMA0_BASE                     (0x40860000U)     /*!< Base address of module TIMA0 */
#define TIMA1_BASE                     (0x40862000U)     /*!< Base address of module TIMA1 */
#define UART3_BASE                     (0x40500000U)     /*!< Base address of module UART3 */
#define UART0_BASE                     (0x40108000U)     /*!< Base address of module UART0 */
#define UART1_BASE                     (0x40100000U)     /*!< Base address of module UART1 */
#define UART2_BASE                     (0x40102000U)     /*!< Base address of module UART2 */
#define COMP0_BASE                     (0x40008000U)     /*!< Base address of module COMP0 */
#define COMP1_BASE                     (0x4000A000U)     /*!< Base address of module COMP1 */
#define COMP2_BASE                     (0x4000C000U)     /*!< Base address of module COMP2 */
#define WUC_BASE                       (0x40424000U)     /*!< Base address of module WUC */
#define FACTORYREGION_BASE             (0x41C40000U)     /*!< Base address of module FACTORYREGION */
#define ADC0_BASE                      (0x40000000U)     /*!< Base address of module ADC0 */
#define ADC0_PERIPHERALREGIONSVT_BASE  (0x40556000U)     /*!< Base address of module ADC0_PERIPHERALREGIONSVT */
#define ADC1_BASE                      (0x40002000U)     /*!< Base address of module ADC1 */
#define ADC1_PERIPHERALREGIONSVT_BASE  (0x40558000U)     /*!< Base address of module ADC1_PERIPHERALREGIONSVT */
#define TIMG0_BASE                     (0x40084000U)     /*!< Base address of module TIMG0 */
#define VREF_BASE                      (0x40030000U)     /*!< Base address of module VREF */
#define MATHACL_BASE                   (0x40410000U)     /*!< Base address of module MATHACL */
#define TIMG12_BASE                    (0x40870000U)     /*!< Base address of module TIMG12 */
#define TIMG6_BASE                     (0x40868000U)     /*!< Base address of module TIMG6 */
#define TIMG7_BASE                     (0x4086A000U)     /*!< Base address of module TIMG7 */
#define TIMG8_BASE                     (0x40090000U)     /*!< Base address of module TIMG8 */
#define DEBUGSS_BASE                   (0x400C7000U)     /*!< Base address of module DEBUGSS */

/*@}*/ /* end of group MSPM0G350X_MemoryMap */

